trade_exp/src/Documents/ЗаявкаВЕГАИСЛес/ЗаявкаВЕГАИСЛес.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаявкаВЕГАИСЛес</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПунктНазначенияЮЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеИЮрАдресЮЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИННЮЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемДревесины</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресРегистрацииФЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерДекларацииЮЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПаспортСерияФЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТипКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПаспортНомерФЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ГосНомерТСЮЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ФИОФЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6a69ca45-0e55-4677-9e8c-10a91d895711">
    <name>НомерДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0707329a-9fe5-4733-be0b-09fbb4099af3">
    <name>ЗаявкаСозданаНаОснованииПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/ЗаказыКДоставке/ЗаказыКДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="81e2ad59-db2f-44b0-bd59-b41113531600">
  <name>ЗаказыКДоставке</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="b3b4dcbf-350b-46ea-a45e-8818c5c59d21">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="07059008-fa97-415d-a41f-dc26d7572867">
    <name>Рейс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="6e8dc3ce-4050-42cf-b74c-de0160eabf02">
    <name>ЗаказНаДоставку</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1b3cd544-3144-477d-80f7-3e6b656db96c">
    <name>ДокументПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Набор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЮрФизЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9f77fc56-3329-4a10-b355-b5c40df8b5c5">
    <name>ИндивидуальныйПредприниматель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1312f787-af91-4e9f-bb79-f968d50d327d">
    <name>ЮрЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Склады</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИспользованиеРабочихУчастков</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТекущийОтветственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НастройкаАдресногоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаАдресногоХраненияОстатков</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РозничныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекущаяДолжностьОтветственного</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтролироватьОперативныеОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыРасходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПересчетовТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеховаяКладовая</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПриходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УчетныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСкладскиеПомещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаИспользованияСкладскихПомещений</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СкладДляБухгалтерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НеРазрешеноРедактированиеЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подотчетник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b6b1d28-2274-4089-bbe0-1f892b513c41">
    <name>Транзит</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="31714690-5baf-46f1-b063-d29c311537f8">
    <name>ТорговыйЗал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6da19460-b28a-45da-95fc-40a81653f323">
    <name>СкрытьКоличествоУчетаВПересчетах</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="efdd8d42-ae41-4592-8382-d99891278ded">
    <name>ТипСкладаПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0ad05e83-cd86-4595-b1cd-604ad5d18c31">
    <name>ДопСкладПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bc9d13f0-85a3-4086-9203-6e34b242f14b">
    <name>ОтправкаУведомлений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3d49e10-572c-4e29-a20e-727c92be2a9e">
    <name>ПовторноеУведомление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="57e1c5a7-2f3b-451e-b301-5b891fe6cb38">
    <name>ТелефонПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="682997ea-3be2-4a30-8770-7535fef1dbdd">
    <name>EMAILподрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6500dc86-8583-4657-936f-1ccc78a87015">
    <name>ДопEMAILподрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="93e0d2a6-ba2b-4dd6-9aa3-ef4cbd740848">
    <name>УведомлятьВБитриксОПоступлениях</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9d5793ec-4952-45ae-ba13-3ea772eca4ae">
    <name>УведомлятьВБитриксОСписанииПодотчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2354dc18-0c64-42c5-8971-6e5307b195f6">
    <name>ИндивидуальныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Documents/ЗаявкаВЕГАИСЛес/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТНДляПеревозкиПиломатериала") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ТНДляПеревозкиПиломатериала", НСтр("ru = 'ТН для перевозки пиломатериала ЮР лицо'"), СформироватьПечатнуюФормуТН(МассивОбъектов));
	КонецЕсли;
	
КонецПроцедуры

Функция ЗапросФормированиеПечатнойФормыБланка(СсылкаНаДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаВЕГАИСЛес.Ссылка КАК Ссылка,
		|	ЗаявкаВЕГАИСЛес.Дата КАК Дата,
		|	ЗаявкаВЕГАИСЛес.НомерДокумента КАК НомерДокумента,
		|	ЗаявкаВЕГАИСЛес.ФИОФЛ КАК ФИОпокупателя,
		|	ЗаявкаВЕГАИСЛес.ПаспортСерияФЛ КАК ПаспортСерия,
		|	ЗаявкаВЕГАИСЛес.ПаспортНомерФЛ КАК ПаспортНомер,
		|	ЗаявкаВЕГАИСЛес.АдресРегистрацииФЛ КАК АдресРегистрации,
		|	ЗаявкаВЕГАИСЛес.Организация.НаименованиеСокращенное КАК НазваниеОрганизации
		|ИЗ
		|	Документ.ЗаявкаВЕГАИСЛес КАК ЗаявкаВЕГАИСЛес
		|ГДЕ
		|	ЗаявкаВЕГАИСЛес.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;
	
КонецФункции

Функция СформироватьПечатнуюФормуБланка(СсылкаНаДокумент) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	МакетОбработки = ПолучитьМакет("БланкПоПиломатериалу");
	ОбластьШапка = МакетОбработки.ПолучитьОбласть("Шапка");
	ОбластьПодвал = МакетОбработки.ПолучитьОбласть("Подвал");
	Для каждого Ссылка из СсылкаНаДокумент Цикл			
		Выборка = ЗапросФормированиеПечатнойФормыБланка(Ссылка.Ссылка);
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,Выборка);
			ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,Выборка);	
		КонецЦикла;	
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Если СуществуютРейсыИлиЗаказыНаДоставку(Ссылка.Основание) Тогда
		Массив = Новый Массив;
        Массив.Добавить(Ссылка);
		ТабДокТН = СформироватьПечатнуюФормуТН(Массив);
		ДобавитьТабдок(ТабличныйДокумент, ТабДокТН);
		ТабличныйДокумент.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
		КонецЕсли;
	КонецЦикла;	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ТолькоПросмотр=Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ЗапросФормированиеПечатнойФормыТН(СсылкаНаДокумент) Экспорт	
	
	Запрос = Новый Запрос;
	//Если СуществуютРейсыИлиЗаказыНаДоставку(СсылкаНаДокумент.Основание) Тогда
	Рейс = Документы.ЗаданиеНаПеревозкуРейс.ПолучитьРейсПоДокументуПродажи(СсылкаНаДокумент.Основание);
	Если Рейс <> Неопределено Тогда 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаВЕГАИСЛес.Ссылка КАК Ссылка,
		|	ЗаявкаВЕГАИСЛес.Дата КАК Дата,
		|	ЗаявкаВЕГАИСЛес.НомерДокумента КАК Номер,
		|	ВЫБОР
		|		КОГДА ЗаявкаВЕГАИСЛес.Склад.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ЗаявкаВЕГАИСЛес.Организация.НаименованиеПолное + "", "" + ОрганизацииКонтактнаяИнформация.Представление
		|		ИНАЧЕ ЗаявкаВЕГАИСЛес.Склад.Грузоотправитель.НаименованиеПолное + "", "" + ГрузоотправителиКонтактнаяИнформация.Представление
		|	КОНЕЦ КАК Грузоотправитель,
		|	ЗаданиеНаПеревозкуРейс.Перевозчик.НаименованиеПолное + "", "" + ЕСТЬNULL(ПеревозчикКонтактнаяИнформация.Представление, """") КАК Перевозчик,
		|	ЗаявкаВЕГАИСЛес.НомерДекларацииЮЛ КАК НомерДекларации,
		|	ЗаявкаВЕГАИСЛес.ОбъемДревесины КАК ОбъемДревесины,
		|	ВЫБОР
		|		КОГДА ЗаявкаВЕГАИСЛес.Склад.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ЗаявкаВЕГАИСЛес.Организация.ИНН
		|		ИНАЧЕ ЗаявкаВЕГАИСЛес.Склад.Грузоотправитель.ИНН
		|	КОНЕЦ КАК ИННГрузоотправителя,
		|	ЗаданиеНаПеревозкуРейс.Автомобиль.Код КАК ГосНомерТС,
		|	ЗаказНаДоставкуКлиенту.АдресДоставки КАК ПунктНазначения,
		|	ЗаданиеНаПеревозкуРейс.Перевозчик.ИНН КАК ИННПеревозчика,
		|	ЗаказНаДоставкуКлиенту.Подразделение.Адрес КАК ПунктОтправления,
		|	ВЫБОР
		|		КОГДА ЗаявкаВЕГАИСЛес.Склад.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ЗаявкаВЕГАИСЛес.Организация.НаименованиеПолное + "", "" + ОрганизацииКонтактнаяИнформация.Представление
		|		ИНАЧЕ ЗаявкаВЕГАИСЛес.Склад.Грузоотправитель.НаименованиеПолное + "", "" + ГрузоотправителиКонтактнаяИнформация.Представление
		|	КОНЕЦ КАК Грузополучатель,
		|	ВЫБОР
		|		КОГДА ЗаявкаВЕГАИСЛес.Склад.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ЗаявкаВЕГАИСЛес.Организация.ИНН
		|		ИНАЧЕ ЗаявкаВЕГАИСЛес.Склад.Грузоотправитель.ИНН
		|	КОНЕЦ КАК ИННГрузополучателя
		|ИЗ
		|	Документ.ЗаявкаВЕГАИСЛес КАК ЗаявкаВЕГАИСЛес
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО ЗаявкаВЕГАИСЛес.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
		|			И (ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК ГрузоотправителиКонтактнаяИнформация
		|		ПО ЗаявкаВЕГАИСЛес.Склад.Грузоотправитель = ГрузоотправителиКонтактнаяИнформация.Ссылка
		|			И (ГрузоотправителиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозкуРейс.РасчетДоставки КАК ЗаданиеНаПеревозкуРейсРасчетДоставки
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозкуРейс КАК ЗаданиеНаПеревозкуРейс
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК ПеревозчикКонтактнаяИнформация
		|				ПО ЗаданиеНаПеревозкуРейс.Перевозчик = ПеревозчикКонтактнаяИнформация.Ссылка
		|					И (ПеревозчикКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
		|			ПО ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка = ЗаданиеНаПеревозкуРейс.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуКлиенту КАК ЗаказНаДоставкуКлиенту
		|			ПО ЗаданиеНаПеревозкуРейсРасчетДоставки.ЗаказНаДоставку = ЗаказНаДоставкуКлиенту.Ссылка
		|		ПО (ЗаявкаВЕГАИСЛес.Основание = ЗаданиеНаПеревозкуРейсРасчетДоставки.ДокументПродажи
		|				ИЛИ ЗаявкаВЕГАИСЛес.Основание.ЗаказКлиента = ЗаданиеНаПеревозкуРейсРасчетДоставки.ДокументПродажи)
		|ГДЕ
		|	ЗаявкаВЕГАИСЛес.Ссылка = &Ссылка";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаВЕГАИСЛес.Ссылка КАК Ссылка,
		|	ЗаявкаВЕГАИСЛес.Дата КАК Дата,
		|	ЗаявкаВЕГАИСЛес.НомерДокумента КАК Номер,
		|	ВЫБОР
		|		КОГДА ЗаявкаВЕГАИСЛес.Склад.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ЗаявкаВЕГАИСЛес.Организация.НаименованиеПолное + "", "" + ОрганизацииКонтактнаяИнформация.Представление
		|		ИНАЧЕ ЗаявкаВЕГАИСЛес.Склад.Грузоотправитель.НаименованиеПолное + "", "" + ГрузоотправителиКонтактнаяИнформация.Представление
		|	КОНЕЦ КАК Грузоотправитель,
		|	ЗаявкаВЕГАИСЛес.НаименованиеИЮрАдресЮЛ КАК Перевозчик,
		|	ЗаявкаВЕГАИСЛес.Контрагент.НаименованиеПолное + "", "" + КонтрагентыКонтактнаяИнформация.Представление КАК Грузополучатель,
		|	ЗаявкаВЕГАИСЛес.ГосНомерТСЮЛ КАК ГосНомерТС,
		|	ЗаявкаВЕГАИСЛес.ПунктНазначенияЮЛ КАК ПунктНазначения,
		|	ЗаявкаВЕГАИСЛес.НомерДекларацииЮЛ КАК НомерДекларации,
		|	ЗаявкаВЕГАИСЛес.ОбъемДревесины КАК ОбъемДревесины,
		|	ВЫБОР
		|		КОГДА ЗаявкаВЕГАИСЛес.Склад.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ЗаявкаВЕГАИСЛес.Организация.ИНН
		|		ИНАЧЕ ЗаявкаВЕГАИСЛес.Склад.Грузоотправитель.ИНН
		|	КОНЕЦ КАК ИННГрузоотправителя,
		|	ЗаявкаВЕГАИСЛес.ИННЮЛ КАК ИННПеревозчика,
		|	ЗаявкаВЕГАИСЛес.Контрагент.ИНН КАК ИННГрузополучателя,
		|	СкладыКонтактнаяИнформация.Представление КАК ПунктОтправления
		|ИЗ
		|	Документ.ЗаявкаВЕГАИСЛес КАК ЗаявкаВЕГАИСЛес
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО ЗаявкаВЕГАИСЛес.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
		|			И (ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|		ПО ЗаявкаВЕГАИСЛес.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка
		|			И (КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация
		|		ПО ЗаявкаВЕГАИСЛес.Склад = СкладыКонтактнаяИнформация.Ссылка
		|			И (СкладыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК ГрузоотправителиКонтактнаяИнформация
		|		ПО ЗаявкаВЕГАИСЛес.Склад.Грузоотправитель = ГрузоотправителиКонтактнаяИнформация.Ссылка
		|			И (ГрузоотправителиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
		|ГДЕ
		|	ЗаявкаВЕГАИСЛес.Ссылка = &Ссылка";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;

КонецФункции

Функция СформироватьПечатнуюФормуТН(СсылкаНаДокумент) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	МакетОбработки = ПолучитьМакет("ТНДляПеревозкиПиломатериала");		
	
	ОбластьШапка = МакетОбработки.ПолучитьОбласть("Шапка");
	ОбластьДанные = МакетОбработки.ПолучитьОбласть("Данные");
	ОбластьПодвал = МакетОбработки.ПолучитьОбласть("Подвал");
	
	Инд = 0;
	Длина1 = 0;
	Длина2 = 0;    
	
	Для каждого Ссылка из СсылкаНаДокумент Цикл			
		
		Выборка = ЗапросФормированиеПечатнойФормыТН(Ссылка.Ссылка);
		
		Пока Выборка.Следующий() Цикл
			
			Инд = 12;
			Длина1 = СтрДлина(Выборка.ИННГрузоотправителя);
			Длина2 = СтрДлина(Выборка.ИННПеревозчика);
			Длина3 = СтрДлина(Выборка.ИННГрузоотправителя);
			
			ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,Выборка);
			
			Пока Инд > 0 Цикл
			    ИмяПараметра1 = "И1"+Инд;
				ИмяПараметра2 = "И2"+Инд;
				ИмяПараметра3 = "И3"+Инд;
				
				Если Длина1 > 0 Тогда
					 ОбластьШапка.Параметры[ИмяПараметра1] = Сред(Выборка.ИННГрузоотправителя,Длина1,1);
				 Иначе
					 ОбластьШапка.Параметры[ИмяПараметра1] = "0";
				КонецЕсли;
				
				Если Длина2 > 0 Тогда
					 ОбластьШапка.Параметры[ИмяПараметра2] = Сред(Выборка.ИННПеревозчика,Длина2,1);
					 Иначе
					 ОбластьШапка.Параметры[ИмяПараметра2] = "0";
				КонецЕсли;
				
				Если Длина3 > 0 Тогда
					 ОбластьШапка.Параметры[ИмяПараметра3] = Сред(Выборка.ИННГрузоотправителя,Длина3,1);
					 Иначе
					 ОбластьШапка.Параметры[ИмяПараметра3] = "0";
				КонецЕсли;
				
				Инд = Инд-1;
				Длина1 = Длина1 - 1;
				Длина2 = Длина2 - 1;
				Длина3 = Длина3 - 1;
			КонецЦикла;
						
			ЗаполнитьЗначенияСвойств(ОбластьДанные.Параметры,Выборка);
			ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,Выборка);
			
		КонецЦикла;	
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ТабличныйДокумент.Вывести(ОбластьДанные);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
		
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьДанныеПоОснованию(Основание, Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(Основание) Тогда
		Запрос = Новый Запрос;                
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЧекККМ") Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВТ_ГруппыЕГАИС
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.ЭтоГруппа = ИСТИНА
			|	И Номенклатура.ЕГАИСЛес = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫРАЗИТЬ(ЧекККМТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
			|	ВЫРАЗИТЬ(ЧекККМТовары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
			|	ЧекККМТовары.КоличествоУпаковок КАК КоличествоУпаковок,
			|	ЧекККМТовары.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ Товары
			|ИЗ
			|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
			|ГДЕ
			|	ЧекККМТовары.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.Ссылка КАК Ссылка,
			|	Товары.Номенклатура КАК Номенклатура,
			|	ВЫБОР
			|		КОГДА Товар.ОбъемЗнаменатель > 0
			|			ТОГДА Товар.ОбъемЧислитель / Товар.ОбъемЗнаменатель * Товары.КоличествоУпаковок
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Объем
			|ПОМЕСТИТЬ ВТ_Товары
			|ИЗ
			|	Товары КАК Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товар
			|		ПО Товары.Номенклатура = Товар.Ссылка
			|ГДЕ
			|	ИСТИНА
			|	И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
			|	И Товары.Номенклатура.Родитель В ИЕРАРХИИ
			|			(ВЫБРАТЬ
			|				Номенклатура.Ссылка КАК Ссылка
			|			ИЗ
			|				ВТ_ГруппыЕГАИС КАК Номенклатура)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЧекККМ.Ссылка КАК Основание,
			|	ЧекККМ.Номер КАК НомерДокумента,
			|	ЧекККМ.Организация КАК Организация,
			|	ЧекККМ.Склад КАК Склад,
			|	ЧекККМ.Партнер КАК Клиент,
			|	ЧекККМ.Подразделение КАК Подразделение,
			|	ТИП(Документ.ЧекККМ) КАК ТипДокумента,
			|	ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо) КАК ТипКлиента,
			|	ЧекККМ.Дата КАК ДатаДокумента,
			|	СУММА(ЕСТЬNULL(ВТ_Товары.Объем, 0)) КАК ОбъемДревесины
			|ИЗ
			|	ВТ_Товары КАК ВТ_Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ КАК ЧекККМ
			|		ПО ВТ_Товары.Ссылка = ЧекККМ.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ЧекККМ.Ссылка,
			|	ЧекККМ.Номер,
			|	ЧекККМ.Организация,
			|	ЧекККМ.Склад,
			|	ЧекККМ.Партнер,
			|	ЧекККМ.Подразделение,
			|	ЧекККМ.Дата";
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВТ_ГруппыЕГАИС
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.ЭтоГруппа = ИСТИНА
			|	И Номенклатура.ЕГАИСЛес = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
			|	ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
			|	РеализацияТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок,
			|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ Товары
			|ИЗ
			|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
			|ГДЕ
			|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.Ссылка КАК Ссылка,
			|	Товары.Номенклатура КАК Номенклатура,
			|	ВЫБОР
			|		КОГДА Товар.ОбъемЗнаменатель > 0
			|			ТОГДА Товар.ОбъемЧислитель / Товар.ОбъемЗнаменатель * Товары.КоличествоУпаковок
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Объем
			|ПОМЕСТИТЬ ВТ_Товары
			|ИЗ
			|	Товары КАК Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товар
			|		ПО Товары.Номенклатура = Товар.Ссылка
			|ГДЕ
			|	ИСТИНА
			|	И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
			|	И Товары.Номенклатура.Родитель В ИЕРАРХИИ
			|			(ВЫБРАТЬ
			|				Номенклатура.Ссылка КАК Ссылка
			|			ИЗ
			|				ВТ_ГруппыЕГАИС КАК Номенклатура)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ЕСТЬNULL(ВТ_Товары.Объем, 0)) КАК ОбъемДревесины,
			|	РеализацияТоваровУслуг.Ссылка КАК Основание,
			|	РеализацияТоваровУслуг.Номер КАК НомерДокумента,
			|	РеализацияТоваровУслуг.Организация КАК Организация,
			|	РеализацияТоваровУслуг.Склад КАК Склад,
			|	РеализацияТоваровУслуг.Партнер КАК Клиент,
			|	РеализацияТоваровУслуг.Подразделение КАК Подразделение,
			|	ТИП(Документ.РеализацияТоваровУслуг) КАК ТипДокумента,
			|	ВЫБОР
			|		КОГДА РеализацияТоваровУслуг.Контрагент.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
			|		И НЕ РеализацияТоваровУслуг.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
			|	КОНЕЦ КАК ТипКлиента,
			|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
			|	ВЫБОР
			|		КОГДА РеализацияТоваровУслуг.Контрагент.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
			|		Или РеализацияТоваровУслуг.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
			|			ТОГДА ВЫБОР
			|					КОГДА КонтрагентыДополнительныеРеквизиты.Свойство.Наименование = ""Номер декларации о сделке с древесиной ЕГАИС (Контрагенты)""
			|						ТОГДА КонтрагентыДополнительныеРеквизиты.Значение
			|				КОНЕЦ
			|	КОНЕЦ КАК НомерДекларацииЮЛ,
			|	РеализацияТоваровУслуг.Дата КАК ДатаДокумента
			|ИЗ
			|	ВТ_Товары КАК ВТ_Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
			|			ПО (РеализацияТоваровУслуг.Контрагент = КонтрагентыДополнительныеРеквизиты.Ссылка
			|					И КонтрагентыДополнительныеРеквизиты.Свойство.Наименование = ""Номер декларации о сделке с древесиной ЕГАИС (Контрагенты)"")
			|		ПО (ВТ_Товары.Ссылка = РеализацияТоваровУслуг.Ссылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	РеализацияТоваровУслуг.Ссылка,
			|	РеализацияТоваровУслуг.Номер,
			|	РеализацияТоваровУслуг.Организация,
			|	РеализацияТоваровУслуг.Склад,
			|	РеализацияТоваровУслуг.Партнер,
			|	РеализацияТоваровУслуг.Подразделение,
			|	РеализацияТоваровУслуг.Контрагент,
			|	ВЫБОР
			|		КОГДА РеализацияТоваровУслуг.Контрагент.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
			|		И НЕ РеализацияТоваровУслуг.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА РеализацияТоваровУслуг.Контрагент.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
			|           Или РеализацияТоваровУслуг.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
			|			ТОГДА ВЫБОР
			|					КОГДА КонтрагентыДополнительныеРеквизиты.Свойство.Наименование = ""Номер декларации о сделке с древесиной ЕГАИС (Контрагенты)""
			|						ТОГДА КонтрагентыДополнительныеРеквизиты.Значение
			|				КОНЕЦ
			|	КОНЕЦ,
			|	РеализацияТоваровУслуг.Дата";
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВТ_ГруппыЕГАИС
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.ЭтоГруппа = ИСТИНА
			|	И Номенклатура.ЕГАИСЛес = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫРАЗИТЬ(ПеремещениеТоваровТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
			|	ВЫРАЗИТЬ(ПеремещениеТоваровТовары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
			|	ПеремещениеТоваровТовары.КоличествоУпаковок КАК КоличествоУпаковок,
			|	ПеремещениеТоваровТовары.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ Товары
			|ИЗ
			|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
			|ГДЕ
			|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.Ссылка КАК Ссылка,
			|	Товары.Номенклатура КАК Номенклатура,
			|	ВЫБОР
			|		КОГДА Товар.ОбъемЗнаменатель > 0
			|			ТОГДА Товар.ОбъемЧислитель / Товар.ОбъемЗнаменатель * Товары.КоличествоУпаковок
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Объем
			|ПОМЕСТИТЬ ВТ_Товары
			|ИЗ
			|	Товары КАК Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товар
			|		ПО Товары.Номенклатура = Товар.Ссылка
			|ГДЕ
			|	ИСТИНА
			|	И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
			|	И Товары.Номенклатура.Родитель В ИЕРАРХИИ
			|			(ВЫБРАТЬ
			|				Номенклатура.Ссылка КАК Ссылка
			|			ИЗ
			|				ВТ_ГруппыЕГАИС КАК Номенклатура)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПеремещениеТоваров.Ссылка КАК Основание,
			|	ПеремещениеТоваров.Номер КАК НомерДокумента,
			|	ПеремещениеТоваров.Организация КАК Организация,
			|	ПеремещениеТоваров.Подразделение КАК Подразделение,
			|	ТИП(Документ.ПеремещениеТоваров) КАК ТипДокумента,
			|	ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо) КАК ТипКлиента,
			|	ПеремещениеТоваров.Дата КАК ДатаДокумента,
			|	СУММА(ЕСТЬNULL(ВТ_Товары.Объем, 0)) КАК ОбъемДревесины,
			|	ПеремещениеТоваров.СкладОтправитель КАК Склад
			|ИЗ
			|	ВТ_Товары КАК ВТ_Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
			|		ПО ВТ_Товары.Ссылка = ПеремещениеТоваров.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ПеремещениеТоваров.Ссылка,
			|	ПеремещениеТоваров.Номер,
			|	ПеремещениеТоваров.Организация,
			|	ПеремещениеТоваров.Подразделение,
			|	ПеремещениеТоваров.Дата,
			|	ПеремещениеТоваров.СкладОтправитель";	
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВТ_ГруппыЕГАИС
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.ЭтоГруппа = ИСТИНА
			|	И Номенклатура.ЕГАИСЛес = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫРАЗИТЬ(ЗаказКлиентаТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
			|	ВЫРАЗИТЬ(ЗаказКлиентаТовары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
			|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
			|	ЗаказКлиентаТовары.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ Товары
			|ИЗ
			|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|ГДЕ
			|	ЗаказКлиентаТовары.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.Ссылка КАК Ссылка,
			|	Товары.Номенклатура КАК Номенклатура,
			|	ВЫБОР
			|		КОГДА Товар.ОбъемЗнаменатель > 0
			|			ТОГДА Товар.ОбъемЧислитель / Товар.ОбъемЗнаменатель * Товары.КоличествоУпаковок
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Объем
			|ПОМЕСТИТЬ ВТ_Товары
			|ИЗ
			|	Товары КАК Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товар
			|		ПО Товары.Номенклатура = Товар.Ссылка
			|ГДЕ
			|	ИСТИНА
			|	И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
			|	И Товары.Номенклатура.Родитель В ИЕРАРХИИ
			|			(ВЫБРАТЬ
			|				Номенклатура.Ссылка КАК Ссылка
			|			ИЗ
			|				ВТ_ГруппыЕГАИС КАК Номенклатура)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ЕСТЬNULL(ВТ_Товары.Объем, 0)) КАК ОбъемДревесины,
			|	ЗаказКлиента.Ссылка КАК Основание,
			|	ЗаказКлиента.Номер КАК НомерДокумента,
			|	ЗаказКлиента.Организация КАК Организация,
			|	ЗаказКлиента.Склад КАК Склад,
			|	ЗаказКлиента.Партнер КАК Клиент,
			|	ЗаказКлиента.Подразделение КАК Подразделение,
			|	ТИП(Документ.ЗаказКлиента) КАК ТипДокумента,
			|	ВЫБОР
			|		КОГДА ЗаказКлиента.Контрагент.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
			|				И НЕ ЗаказКлиента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
			|	КОНЕЦ КАК ТипКлиента,
			|	ЗаказКлиента.Контрагент КАК Контрагент,
			|	ВЫБОР
			|		КОГДА ЗаказКлиента.Контрагент.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
			|				Или ЗаказКлиента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
			|			ТОГДА ВЫБОР
			|					КОГДА КонтрагентыДополнительныеРеквизиты.Свойство.Наименование = ""Номер декларации о сделке с древесиной ЕГАИС (Контрагенты)""
			|						ТОГДА КонтрагентыДополнительныеРеквизиты.Значение
			|				КОНЕЦ
			|	КОНЕЦ КАК НомерДекларацииЮЛ,
			|	ЗаказКлиента.Дата КАК ДатаДокумента
			|ИЗ
			|	ВТ_Товары КАК ВТ_Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
			|			ПО (ЗаказКлиента.Контрагент = КонтрагентыДополнительныеРеквизиты.Ссылка
			|					И КонтрагентыДополнительныеРеквизиты.Свойство.Наименование = ""Номер декларации о сделке с древесиной ЕГАИС (Контрагенты)"")
			|		ПО (ВТ_Товары.Ссылка = ЗаказКлиента.Ссылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаказКлиента.Ссылка,
			|	ЗаказКлиента.Номер,
			|	ЗаказКлиента.Организация,
			|	ЗаказКлиента.Склад,
			|	ЗаказКлиента.Партнер,
			|	ЗаказКлиента.Подразделение,
			|	ЗаказКлиента.Контрагент,
			|	ВЫБОР
			|		КОГДА ЗаказКлиента.Контрагент.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
			|				И НЕ ЗаказКлиента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗаказКлиента.Контрагент.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
			|				Или ЗаказКлиента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
			|			ТОГДА ВЫБОР
			|					КОГДА КонтрагентыДополнительныеРеквизиты.Свойство.Наименование = ""Номер декларации о сделке с древесиной ЕГАИС (Контрагенты)""
			|						ТОГДА КонтрагентыДополнительныеРеквизиты.Значение
			|				КОНЕЦ
			|	КОНЕЦ,
			|	ЗаказКлиента.Дата";
		КонецЕсли;
		Запрос.УстановитьПараметр("Ссылка", Основание);
		 
		Выборка= Запрос.Выполнить().Выбрать();
			
		Если Выборка.Количество() = 0 Тогда
			Сообщить("Табличная часть выбранного документа не содержит пиломатериалы из сосны!");
		КонецЕсли;
			
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Объект,Выборка);
		КонецЕсли;
			
		Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
			Объект.Контрагент = ПартнерыИКонтрагенты.ПолучитьКонтрагентаПартнераПоУмолчанию(Объект.Клиент);
		КонецЕсли;
			
		Если Объект.ТипКлиента = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо И ЗначениеЗаполнено(Объект.Клиент) Тогда
			Объект.ФИОФЛ = Объект.Клиент.Наименование;
		КонецЕсли;
				
	КонецЕсли;                               
	
	УстановитьПривилегированныйРежим(Ложь); 
	
КонецПроцедуры

Процедура ДобавитьТабдок(ТДПриемник, ТДИсточник)Экспорт
	
	ТДИсточник.Область(1,1,ТДИсточник.ВысотаТаблицы,
	ТДИсточник.ШиринаТаблицы).СоздатьФорматСтрок();
	ТДПриемник.Вывести(ТДИсточник);
	ТДПриемник.ВывестиГоризонтальныйРазделительСтраниц();
	
КонецПроцедуры

Функция СуществуютРейсыИлиЗаказыНаДоставку(Объект)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыКДоставке.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ЗаказыКДоставке КАК ЗаказыКДоставке
	|ГДЕ
	|	ЗаказыКДоставке.ДокументПродажи = &ДокументПродажи";
	
	Запрос.УстановитьПараметр("ДокументПродажи", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		 Возврат Истина;
	 Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПроверкаНаличияЗаявкиНаСоответствующийДокументПродажи(СсылкаНаДокумент) Экспорт	

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ГруппыЕГАИС
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ИСТИНА
		|	И Номенклатура.ЕГАИСЛес = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЧекККМ.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ДокументьПродажиНаличиеТовара
		|ИЗ
		|	Документ.ЧекККМ КАК ЧекККМ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Товары КАК ЧекККМТовары
		|		ПО ЧекККМ.Ссылка = ЧекККМТовары.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО (ЧекККМТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка)
		|ГДЕ
		|	ЧекККМ.Ссылка = &Ссылка
		|	И ЧекККМТовары.Номенклатура.Родитель В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				Номенклатура.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТ_ГруппыЕГАИС КАК Номенклатура)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО РеализацияТоваровУслуг.Ссылка = РеализацияТоваровУслугТовары.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО (РеализацияТоваровУслугТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка)
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка
		|	И РеализацияТоваровУслугТовары.Номенклатура.Родитель В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				Номенклатура.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТ_ГруппыЕГАИС КАК Номенклатура)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДокументьПродажиНаличиеТовара.Ссылка КАК Ссылка,
		|	ЗаявкаВЕГАИСЛес.Ссылка КАК ЗаявкаВЕГАИСЛес,
		|	ЗаявкаВЕГАИСЛес.Проведен КАК Проведен,
		|	ЗаявкаВЕГАИСЛес.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	ВТ_ДокументьПродажиНаличиеТовара КАК ВТ_ДокументьПродажиНаличиеТовара
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаВЕГАИСЛес КАК ЗаявкаВЕГАИСЛес
		|		ПО ВТ_ДокументьПродажиНаличиеТовара.Ссылка = ЗаявкаВЕГАИСЛес.Основание";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ОшибкаНайдена = Ложь;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ЗаявкаВЕГАИСЛес = Null Тогда
			Сообщить("Заявка в ЕГАИС Лес по данному документу отсутствует (создайте документ нажав на соответствующую кнопку)!");
			ОшибкаНайдена = Истина;
		Иначе
			Если Не ВыборкаДетальныеЗаписи.Проведен Тогда
				Если ВыборкаДетальныеЗаписи.ПометкаУдаления Тогда
		             Сообщить("Заявка в ЕГАИС Лес по данному документу помечена на удаление (снимите пометку на удаление, исправьте документ при необходимости и проведите его)!");
				 Иначе
					 Сообщить("Заявка в ЕГАИС Лес по данному документу не проведена (исправьте документ при необходимости и проведите его)!");
				КонецЕсли;
				АльтерраОбщегоНазначения.СообщитьПользователю(ВыборкаДетальныеЗаписи .ЗаявкаВЕГАИСЛес, Строка(ВыборкаДетальныеЗаписи .ЗаявкаВЕГАИСЛес));
		        ОшибкаНайдена = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ОшибкаНайдена;
	
КонецФункции

Процедура ПроверкаНаличияЗаявкиПриСозданииНовой(СсылкаНаДокумент,Отказ) Экспорт	
	
	Заявка = Документы.ЗаявкаВЕГАИСЛес.НайтиПоРеквизиту("Основание",СсылкаНаДокумент);
	Если Не Заявка.Пустая() Тогда
		 Сообщить("Заявка в ЕГАИС Лес по данному документу продажи уже существует!");
		 АльтерраОбщегоНазначения.СообщитьПользователю(Заявка, Строка(Заявка));
		 Отказ = Истина;
	 КонецЕсли; 
	 
КонецПроцедуры

Функция ПолучитьДанныеФЛ(Партнер,Контрагент) Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("ФИО",Партнер.Наименование);
	Структура.Вставить("Адрес",УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Партнер,Справочники.ВидыКонтактнойИнформации.АдресПартнера));
	Структура.Вставить("Паспорт",ФизическиеЛицаУТ.ПолучитьДокументФизическогоЛицаПоУмолчанию(Контрагент,Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ));
	Возврат Структура;
	
КонецФункции

Процедура СозданиеОбновлениеЗаявкиЛесЕГАИСРеализации(Объект)Экспорт
	
	ЕстьПиломатериалы = ЕстьПиломатериалыВДокументе(Объект.Ссылка);
	Если ЕстьПиломатериалы = Истина Тогда
		Заявка = Документы.ЗаявкаВЕГАИСЛес.НайтиПоРеквизиту("Основание",Объект.Ссылка);
		Если Заявка.Пустая() Тогда
			ЗаявкаЕГАИС = Документы.ЗаявкаВЕГАИСЛес.СоздатьДокумент();
			Документы.ЗаявкаВЕГАИСЛес.ЗаполнитьДанныеПоОснованию(Объект.Ссылка, ЗаявкаЕГАИС);
			ЗаявкаЕГАИС.Дата = ЗаявкаЕГАИС.ДатаДокумента; 
			ЗаявкаЕГАИС.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Создана заявка Лес ЕГАИС");
		Иначе 
			ЗаявкаЕГАИС = Заявка.Ссылка.ПолучитьОбъект();
			Если Не ЗаявкаЕГАИС.Статус Тогда
				Документы.ЗаявкаВЕГАИСЛес.ЗаполнитьДанныеПоОснованию(Объект.Ссылка, ЗаявкаЕГАИС);
				//Изменяем дату заявки в ЕГАИС Лес при установке отметки кассы на реализацию 
				Если Объект.ДополнительныеСвойства.УстановкаОтметки = Истина Тогда
					ЗаявкаЕГАИС.Дата = ТекущаяДата();					
				Иначе 
					ЗаявкаЕГАИС.Дата = ЗаявкаЕГАИС.ДатаДокумента;
				КонецЕсли;
				Попытка 
			 		ЗаявкаЕГАИС.Записать(РежимЗаписиДокумента.Проведение);
					Сообщить("Изменена заявка Лес ЕГАИС - " + ЗаявкаЕГАИС);
				Исключение 
					Сообщить(ОписаниеОшибки());                               
				КонецПопытки;
			Иначе
				Сообщить("Заявка уже внесена! Данные не изменены у документа - " + ЗаявкаЕГАИС);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СозданиеЗаявкиЛесЕГАИС(Ссылка) Экспорт
	
	ЕстьПиломатериалы = ЕстьПиломатериалыВДокументе(Ссылка);
	Если ЕстьПиломатериалы = Истина Тогда
		Заявка = Документы.ЗаявкаВЕГАИСЛес.НайтиПоРеквизиту("Основание",Ссылка);
		Если Заявка.Пустая() Тогда
			ЗаявкаЕГАИС = Документы.ЗаявкаВЕГАИСЛес.СоздатьДокумент();
			Документы.ЗаявкаВЕГАИСЛес.ЗаполнитьДанныеПоОснованию(Ссылка, ЗаявкаЕГАИС);
			
			Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				ЗаявкаЕГАИС.Дата = ТекущаяДата();
			Иначе		
				ЗаявкаЕГАИС.Дата = ЗаявкаЕГАИС.ДатаДокумента;
			КонецЕсли;
			
			Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
				ЗаявкаЕГАИС.ЗаявкаСозданаНаОснованииПеремещения = Истина;
				ЗаявкаЕГАИС.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("ЦО Альтерра", Истина);
				ЗаявкаЕГАИС.Клиент = ЗаявкаЕГАИС.Контрагент.Партнер;
			КонецЕсли;
			
		ИначеЕсли НЕ Заявка.Проведен Тогда
			ЗаявкаЕГАИС = Заявка.ПолучитьОбъект();
			Документы.ЗаявкаВЕГАИСЛес.ЗаполнитьДанныеПоОснованию(Ссылка, ЗаявкаЕГАИС);
			ЗаявкаЕГАИС.Дата = ЗаявкаЕГАИС.ДатаДокумента;
			ЗаявкаЕГАИС.ПометкаУдаления = Ложь;
			ЗаявкаЕГАИС.Статус = Ложь;
		КонецЕсли;
		Попытка 
			ЗаявкаЕГАИС.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Создана/обновлена заявка Лес ЕГАИС");
		Исключение 
			                               
		КонецПопытки;

	КонецЕсли;
	
КонецПроцедуры

Функция ЕстьПиломатериалыВДокументе(Ссылка)Экспорт 
	
	Запрос = Новый Запрос;
	Если ТипЗнч(Ссылка)= Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 	
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ГруппыЕГАИС
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ИСТИНА
		|	И Номенклатура.ЕГАИСЛес = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
		|	И РеализацияТоваровУслугТовары.Номенклатура.Родитель В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				Номенклатура.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТ_ГруппыЕГАИС КАК Номенклатура)";
		
	ИначеЕсли ТипЗнч(Ссылка)= Тип("ДокументСсылка.ПеремещениеТоваров") Тогда 	
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ГруппыЕГАИС
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ИСТИНА
		|	И Номенклатура.ЕГАИСЛес = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеТоваров.Номенклатура КАК Номенклатура,
		|	ПеремещениеТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.Ссылка = &Ссылка
		|	И ПеремещениеТоваров.Номенклатура.Родитель В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				Номенклатура.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТ_ГруппыЕГАИС КАК Номенклатура)";
		
	ИначеЕсли ТипЗнч(Ссылка)= Тип("ДокументСсылка.ЧекККМ") Тогда 
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|	ПОМЕСТИТЬ ВТ_ГруппыЕГАИС
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ИСТИНА
		|	И Номенклатура.ЕГАИСЛес = ИСТИНА
		|	;
		|			
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЧекККМТовары.Номенклатура КАК Номенклатура,				
		|	ЧекККМТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		|ГДЕ
		|	ЧекККМТовары.Ссылка = &Ссылка
		|	И ЧекККМТовары.Номенклатура.Родитель В ИЕРАРХИИ
		|		(ВЫБРАТЬ
		|			Номенклатура.Ссылка КАК Ссылка
		|		ИЗ
		|			ВТ_ГруппыЕГАИС КАК Номенклатура)";

	ИначеЕсли ТипЗнч(Ссылка)= Тип("ДокументСсылка.ЗаказКлиента") Тогда 
		 Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|	ПОМЕСТИТЬ ВТ_ГруппыЕГАИС
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ИСТИНА
		|	И Номенклатура.ЕГАИСЛес = ИСТИНА
		|	;
		|			
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,				
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		|	И ЗаказКлиентаТовары.Номенклатура.Родитель В ИЕРАРХИИ
		|		(ВЫБРАТЬ
		|			Номенклатура.Ссылка КАК Ссылка
		|		ИЗ
		|			ВТ_ГруппыЕГАИС КАК Номенклатура)";

	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Процедура ОтменитьПроведениеЗаявкиЕГАИСЛес(Ссылка)Экспорт 
	
	Заявка = Документы.ЗаявкаВЕГАИСЛес.НайтиПоРеквизиту("Основание",Ссылка);
	Если НЕ Заявка.Пустая() Тогда
		ЗаявкаЕГАИС = Заявка.Ссылка.ПолучитьОбъект();
		Если Не ЗаявкаЕГАИС.Статус Тогда
			ЗаявкаЕГАИС.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Иначе
			Сообщить("Заявка уже внесена! Данные не изменены у документа - " + ЗаявкаЕГАИС);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПометкаНаУдалениеЗаявкиЕГАИСЛес(Ссылка)Экспорт
	
	Заявка = Документы.ЗаявкаВЕГАИСЛес.НайтиПоРеквизиту("Основание",Ссылка);
	Если НЕ Заявка.Пустая() Тогда
		ЗаявкаЕГАИС = Заявка.Ссылка.ПолучитьОбъект();
		Если Не ЗаявкаЕГАИС.Статус Тогда
			Если Ссылка.ПометкаУдаления Тогда  
				ЗаявкаЕГАИС.ПометкаУдаления = Истина;
				ЗаявкаЕГАИС.Записать();
				Сообщить("Помечена на удаление заявка Лес ЕГАИС - " + ЗаявкаЕГАИС);
			Иначе
				ЗаявкаЕГАИС.ПометкаУдаления = Ложь;
				ЗаявкаЕГАИС.Записать();
			КонецЕсли;
		Иначе
			Сообщить("Заявка уже внесена! Данные не изменены у документа - " + ЗаявкаЕГАИС);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверкаЕГАИС(ДокументПродажи, ЭтотОбъект) Экспорт
	
	СвязанныеДокументы = КритерииОтбора.СвязанныеДокументы.Найти(ДокументПродажи);
	ДокументЕГАИС = Неопределено;
	
	Для каждого Документ из СвязанныеДокументы Цикл
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаявкаВЕГАИСЛес") И НЕ Документ.Статус Тогда
			ДокументЕГАИС = Документ;
		КонецЕсли;
	КонецЦикла;
	
	Если ДокументЕГАИС <> Неопределено Тогда
		Если Документы.ЗаявкаВЕГАИСЛес.ЕстьПиломатериалыВДокументе(ДокументПродажи) Тогда
			ОбъемДревесиныАкта = 0;
			ОбъемДревесиныДокументаОснования = 0;
			РассчетОбъемДревесиныДокументаОснования(ОбъемДревесиныДокументаОснования, ДокументПродажи);
			РассчетОбъемДревесиныАкта(ОбъемДревесиныАкта, ЭтотОбъект);
			ОбъектДокументЕГАИС = ДокументЕГАИС.ПолучитьОбъект();
			ОбъектДокументЕГАИС.ОбъемДревесины = ОбъемДревесиныДокументаОснования - ОбъемДревесиныАкта;
			ОбъектДокументЕГАИС.Записать();
			Если ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.ВозвратТоваровОтКлиента") Тогда
				ТекстСообщенияВБт24 ="Был создан возврат на пиломатериал, в документе " + ДокументЕГАИС + " был изменен объем древесины. Его документ основания: " + ДокументПродажи;
			ИначеЕсли ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
				ТекстСообщенияВБт24 ="Была создана корректировка на пиломатериал, в документе " + ДокументЕГАИС + " был изменен объем древесины. Его документ основания: " + ДокументПродажи;
			КонецЕсли;
			АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитриксПоИДЧата(ТекстСообщенияВБт24, "chat94681");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

Функция РассчетОбъемДревесиныДокументаОснования(ОбъемДревесиныДокументаОснования, ДокументПродажи) Экспорт
	
	Если ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслугТовары.Количество КАК Количество,
		|	РеализацияТоваровУслугТовары.Номенклатура.ОбъемЧислитель КАК ОбъемЧислитель,
		|	РеализацияТоваровУслугТовары.Номенклатура.ОбъемЗнаменатель КАК ОбъемЗнаменатель
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
		|	И РеализацияТоваровУслугТовары.Номенклатура.Родитель В ИЕРАРХИИ
		|		(ВЫБРАТЬ
		|			Номенклатура.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.Номенклатура КАК Номенклатура
		|		ГДЕ
		|			Номенклатура.ЭтоГруппа = ИСТИНА
		|			И Номенклатура.ЕГАИСЛес = ИСТИНА)";
	
	ИначеЕсли ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.ЧекККМ") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЧекККМТовары.Номенклатура КАК Номенклатура,
		|	ЧекККМТовары.Ссылка КАК Ссылка,
		|	ЧекККМТовары.Количество КАК Количество,
		|	ЧекККМТовары.Номенклатура.ОбъемЧислитель КАК ОбъемЧислитель,
		|	ЧекККМТовары.Номенклатура.ОбъемЗнаменатель КАК ОбъемЗнаменатель
		|ИЗ
		|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		|ГДЕ
		|	ЧекККМТовары.Ссылка = &Ссылка
		|	И ЧекККМТовары.Номенклатура.Родитель В ИЕРАРХИИ
		|		(ВЫБРАТЬ
		|			Номенклатура.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.Номенклатура КАК Номенклатура
		|		ГДЕ
		|			Номенклатура.ЭтоГруппа = ИСТИНА
		|			И Номенклатура.ЕГАИСЛес = ИСТИНА)";
	
	КонецЕсли;
		
		Запрос.УстановитьПараметр("Ссылка", ДокументПродажи);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаНоменклатурыРеализации = РезультатЗапроса.Выгрузить();
		
		Для каждого Строка из ВыборкаНоменклатурыРеализации Цикл 
			ОбъемДревесиныДокументаОснования = ОбъемДревесиныДокументаОснования + ((Строка.ОбъемЧислитель / Строка.ОбъемЗнаменатель) * Строка.Количество)
		КонецЦикла;
	
	Возврат ОбъемДревесиныДокументаОснования
	
КонецФункции 

Функция РассчетОбъемДревесиныАкта(ОбъемДревесиныАкта, ЭтотОбъект) Экспорт
	
		НоменклатураПиломатериал = Новый Массив;
				
		Для Каждого Строка ИЗ ЭтотОбъект.Товары Цикл 
			Если Строка.Номенклатура.ЦеноваяГруппа = Справочники.ЦеновыеГруппы.НайтиПоНаименованию("Пиломатериал основной ассортимент") ИЛИ
				Строка.Номенклатура.ЦеноваяГруппа = Справочники.ЦеновыеГруппы.НайтиПоНаименованию("Пиломатериал основной ассортимент н/к") Тогда
				ОбъемДревесиныАкта  = ОбъемДревесиныАкта  + ((Строка.Номенклатура.ОбъемЧислитель / Строка.Номенклатура.ОбъемЗнаменатель) * Строка.Количество)
			КонецЕсли;
		КонецЦикла;

		Возврат ОбъемДревесиныАкта  
	
КонецФункции




#КонецЕсли
